In [49]:
!pip install pandas

Requirement already satisfied: pandas in c:\tools\anaconda3\lib\site-packages (1.4.4)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\tools\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.18.5 in c:\tools\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: pytz>=2020.1 in c:\tools\anaconda3\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: six>=1.5 in c:\tools\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [50]:
!pip install numpy

Requirement already satisfied: numpy in c:\tools\anaconda3\lib\site-packages (1.21.5)

In [51]:
import pandas as pd
import numpy as np

### String

In [52]:
print("Hello world")

Hello world

In [53]:
# string and fstring in Python
my_name = "James"
my_job = "British agent"
my_age = "40"
my_long_lines = """My name is Bond.
James Bond."""

# fstring
# want the output as "My name is James, 40 years old British agent."
print(f"My name is {my_name}, {my_age} year old {my_job}.")

My name is James, 40 year old British agent.

###  String Method

In [54]:
text = "This is the text, innit."
type(text)

str

In [55]:
text.lower()

'this is the text, innit.'

In [56]:
text.upper()

'THIS IS THE TEXT, INNIT.'

In [57]:
text.encode()

b'This is the text, innit.'

In [58]:
text.replace('text','string')

'This is the string, innit.'

### Lists

In [59]:
pioneers = ['Bernelli', 'Furuholen', 'Matilda', 'Matteo', 'Emilia']
pioneers[1:4]

['Furuholen', 'Matilda', 'Matteo']

In [60]:
pioneers.append('Catherine')
pioneers[:]

['Bernelli', 'Furuholen', 'Matilda', 'Matteo', 'Emilia', 'Catherine']

In [61]:
pioneers_df = pd.DataFrame(pioneers)
pioneers_df

           0
0   Bernelli
1  Furuholen
2    Matilda
3     Matteo
4     Emilia
5  Catherine

In [62]:
pioneers_df.iloc[1:3]

           0
1  Furuholen
2    Matilda

### Dictionaries

In [63]:
# We could build key-value pairs of dictionary using curly brackets to define it
pioneers_dict = {
    "id": 1,
    "name": 'Mathilda',
    "class": 'Musketeer',
    "weapon": ["Rifles", "Pistols", "Bayonette"]
}

In [64]:
pioneers_dict

{'id': 1,
 'name': 'Mathilda',
 'class': 'Musketeer',
 'weapon': ['Rifles', 'Pistols', 'Bayonette']}

In [65]:
pioneers_dict["weapon"]

['Rifles', 'Pistols', 'Bayonette']

In [66]:
pioneers_dict["weapon"][0]

'Rifles'

In [67]:
pioneers_dict.keys()

dict_keys(['id', 'name', 'class', 'weapon'])

In [68]:
pioneers_dict.values()

dict_values([1, 'Mathilda', 'Musketeer', ['Rifles', 'Pistols', 'Bayonette']])

In [69]:
# add the new keys to the existing observations
pioneers_dict["origin"] = "Barracks"
pioneers_dict

{'id': 1,
 'name': 'Mathilda',
 'class': 'Musketeer',
 'weapon': ['Rifles', 'Pistols', 'Bayonette'],
 'origin': 'Barracks'}

In [70]:
# update values
pioneers_dict["name"] = "Bernelli"
pioneers_dict["origin"] = "Bristia"
pioneers_dict['weapons'] = ["Rifles","Pistols"]
pioneers_dict

{'id': 1,
 'name': 'Bernelli',
 'class': 'Musketeer',
 'weapon': ['Rifles', 'Pistols', 'Bayonette'],
 'origin': 'Bristia',
 'weapons': ['Rifles', 'Pistols']}

### Functions

In [71]:
# we use 'def' keywords to define the funcitons
def hello():
    print("Hello world!")

In [72]:
hello()

Hello world!

In [73]:
def greetings(name, surname):
    print(f"My name's {surname}, {name} {surname}.")

In [74]:
greetings("James", "Bond")

My name's Bond, James Bond.

In [75]:
greetings("Jonathan", "Wick")

My name's Wick, Jonathan Wick.

### OOP

In [76]:
# like java, we could build up each object of python as a class
class Character:
    # build up the atribute
    name = "Furuholen"
    specialty = "Musketeers"
    origin = "Vesponola"
    stances = ["Gigantic Blaster","Install Trap"]

    # build up the method, we use 'self' keywrod which means self-applied (no arguments required)
    def shoot(self):
        print("Bang Bang")

In [77]:
# build the instance of built class, and call for the class
my_character = Character()
type(my_character)

__main__.Character

In [78]:
# access the instance's items
my_character.stances

['Gigantic Blaster', 'Install Trap']

In [79]:
# call for the method
my_character.shoot()

Bang Bang

### Pandas

In [80]:
# create the dataframe from scratch
# there're numbers of ways to built the dataframe, but we will buile it from dictionaries first
barracks_dict = {
    "id": [1,2,3,4,5],
    "name": ["Mathilda","Bernelli","Adelina","Matteo","Catherine"],
    "Specialty": ["Musketeers","Musketeers","Fighter","Warlock","Wizard"],
    "Weapons": ["Pistols","Rifles","Saber","Bracelet","Controller"]
}

In [81]:
barracks_df = pd.DataFrame(barracks_dict)
barracks_df

   id       name   Specialty     Weapons
0   1   Mathilda  Musketeers     Pistols
1   2   Bernelli  Musketeers      Rifles
2   3    Adelina     Fighter       Saber
3   4     Matteo     Warlock    Bracelet
4   5  Catherine      Wizard  Controller

In [82]:
barracks_df.iloc[0:2]

   id      name   Specialty  Weapons
0   1  Mathilda  Musketeers  Pistols
1   2  Bernelli  Musketeers   Rifles

In [83]:
barracks_df.loc[0:2]

   id      name   Specialty  Weapons
0   1  Mathilda  Musketeers  Pistols
1   2  Bernelli  Musketeers   Rifles
2   3   Adelina     Fighter    Saber

In [84]:
# add the new column
barracks_df["Town"] = ["Rebordeoux","Coimbra","Coimbra","Rebordeaux","Auch"]
barracks_df

   id       name   Specialty     Weapons        Town
0   1   Mathilda  Musketeers     Pistols  Rebordeoux
1   2   Bernelli  Musketeers      Rifles     Coimbra
2   3    Adelina     Fighter       Saber     Coimbra
3   4     Matteo     Warlock    Bracelet  Rebordeaux
4   5  Catherine      Wizard  Controller        Auch

In [85]:
barracks_df.shape

(5, 5)

In [86]:
# drop the column, then self-assigned the values
barracks_df = barracks_df.drop("Town",axis=1)
barracks_df

   id       name   Specialty     Weapons
0   1   Mathilda  Musketeers     Pistols
1   2   Bernelli  Musketeers      Rifles
2   3    Adelina     Fighter       Saber
3   4     Matteo     Warlock    Bracelet
4   5  Catherine      Wizard  Controller

In [87]:
# remove observation (rows) using index
barracks_df = barracks_df.drop(0, axis=0)
barracks_df

   id       name   Specialty     Weapons
1   2   Bernelli  Musketeers      Rifles
2   3    Adelina     Fighter       Saber
3   4     Matteo     Warlock    Bracelet
4   5  Catherine      Wizard  Controller

In [88]:
# reset the indexes due to deleted rows
barracks_df = barracks_df.reset_index(drop=True)
barracks_df

   id       name   Specialty     Weapons
0   2   Bernelli  Musketeers      Rifles
1   3    Adelina     Fighter       Saber
2   4     Matteo     Warlock    Bracelet
3   5  Catherine      Wizard  Controller

In [89]:
# rename the column
barracks_df.columns = ["no","surname","class","specialties"]
barracks_df

   no    surname       class specialties
0   2   Bernelli  Musketeers      Rifles
1   3    Adelina     Fighter       Saber
2   4     Matteo     Warlock    Bracelet
3   5  Catherine      Wizard  Controller

### Series vs DataFrames

In [90]:
# we could say that DataFrame is Series(rows) of Series(columns)
type(barracks_df.surname)

pandas.core.series.Series

In [91]:
type(barracks_df)

pandas.core.frame.DataFrame

In [92]:
# create the new series (new observation) in existed df
s1 = pd.Series([6, "Helena", "Warlock", "Bracelet"], index=["no","surname","class","specialties"])
print(s1)
print(type(s1))

no                    6
surname          Helena
class           Warlock
specialties    Bracelet
dtype: object
<class 'pandas.core.series.Series'>

In [93]:
# append built series onto existing dataframe
barracks_df = barracks_df.append(s1, ignore_index=True)

C:\Users\abejr\AppData\Local\Temp\ipykernel_6796\2869921054.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  barracks_df = barracks_df.append(s1, ignore_index=True)

In [94]:
# create existed column into existing dataframe
s2 = pd.Series(["Coimbra","Coimbra","Rebordeux","Auch","Rebordeux"])
barracks_df["town"] = s2
barracks_df

   no    surname       class specialties       town
0   2   Bernelli  Musketeers      Rifles    Coimbra
1   3    Adelina     Fighter       Saber    Coimbra
2   4     Matteo     Warlock    Bracelet  Rebordeux
3   5  Catherine      Wizard  Controller       Auch
4   6     Helena     Warlock    Bracelet  Rebordeux

### Write CSV files

In [95]:
# write the dataframe into the new CSV files, file will be exported to working directory
barracks_df.to_csv("mybarracks.csv")

In [96]:
# import the new csv files from current working directory
df2 = pd.read_csv("datafiles/data.csv")
df2

   id   name        city
0   1   John      London
1   2    Joe   Liverpool
2   3   Mary  Manchester
3   4   Anna     Swansea
4   5  David      London

In [97]:
# import the new xlsx files from current working directory
# to do that, we need the additional package called openpyxl first
%pip install openpyxl
import openpyxl

Requirement already satisfied: openpyxl in c:\tools\anaconda3\lib\site-packages (3.0.10)
Requirement already satisfied: et_xmlfile in c:\tools\anaconda3\lib\site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [98]:
# then we import the xls files into notebook
df3 = pd.read_excel("datafiles/data.xlsx")
df3

   id   name        city
0   1   John      London
1   2    Joe   Liverpool
2   3   Mary  Manchester
3   4   Anna     Swansea
4   5  David      London

In [99]:
# import JSON files into notebook
df4 = pd.read_json("datafiles/data.json")
df4

                         ebook language  amazonRating
0  Getting started with Python   python          4.89
1            Introduction to R        r          4.88
2            SQL for Beginners      sql          4.75